---
kind: method
id: M:Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetAllSolutionsPartsTypeCounts
source: html/54762be7-5567-1c25-0658-e137738eeb61.htm
---
# Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetAllSolutionsPartsTypeCounts Method

Returns the total fabrication part type usage count in all routing solutions.

## Syntax (C#)
```csharp
public IDictionary<ElementId, int> GetAllSolutionsPartsTypeCounts()
```